
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#####元组把中括号改成括号。。  不可修改的列表（不能增删改）
####l = ["qq","ww","ee","rr"]
####a = ("qq","ww","ee","rr")
######for n in a:
######    print (n)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\练习
######a = list(range(0,1000001)) #创建列表，包含0~~一百万
########for n in a:           #输出0~~一百万
########    print(n)
######
######print (sum(a))           #求和
######
######b = list(range(1,21,2))  #列表生成1~20 中的奇数
######print(b)
####
####
####\\\\\\\\\\\\\\\#合并列表
####l1 = ["Lihua","Rain","Jack","Xiuxiu","Peiqi","Black"]
####l2 = ["qq","ww","ee","rr"]
####
######l1.extend(l2)   #合并列表
######print (l1)
####
######l = l1 + l2   #用加法的方式合并于l表
######print (l)
######l1 = l1+l2
####l1 +=l2
####print (l1)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#####复制列表
####names = ["Lihua","Rain","Jack","Xiuxiu","Peiqi","Black"]
#####newl = names[:]   #复制列表
####newl = names*2     #复制2份，就是*2
####newl[0] = "xixi"
####print (names)
####print(newl)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####v = 10
####v2 =10
####v3 =10
####v4 =10
####v5 =10
######v = v+1      #是相等的v+ = 1就是v =v+1  加减乘除是一样的（+ - * / %）
####v +=1
####print (v)
######v = v-1
####v2 -=1
####print (v2)
####v3 *=2
####print (v3)
####v4 /=2
####print (v4)
####v5 %=3         #求余数
####print (v5)
####s = "nihao"
####s = s + "!!"
####print (s)
####
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####l = list(range(1,11))  #生成列表l ,表里含数字1~10
####print (l)
####print (min(l))         #最大
####print (max(l))         #最小
####print (sum(l))         #总和
####
####l2 = [n**2 for n in range(1,11)]  #列表生成 1~10 的数字的平方，使用for循环，练习的简写
####print (l2)
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\#创建有规律的（递增）数字列表
####names = ["Lihua","Rain","Jack","Xiuxiu","Peiqi","Black","yi","er",]
#####range(3,10)             #range方法生成数字,包含开始的数字不包含结束的数字
####l = list(range(3,10))       #list方法把生成的数字变成列表
####print(l)
####l2 = list(range(3,10,2))  #range方法默认增涨数1 ，设置第三个参数可改增长，改为2，每次涨2 
####print(l2)
####
#####练习：创建一个表，包括1~~10的数字，在生成一个（1~~10）次方的表
#####方法一
####l3 = list(range(1,11))    #创建表（1~~10）
####print(l3)
####nl3 = []                  #创建一个空的列表
####for n in l3 :             #for循环，n是临时变量
####    m = n**2              #定义m被赋值为n的次方
####    nl3.append(m)         #调用插入数据的方法，在新列nl3中插入新数据m，一个循环
####print(nl3) 
#####方法二
####nl4 = []             
####for n2 in range(1,11) :   #直接在range方法里改，找到数字变成次方
####     nl4.append(n2**2)    #再插入新的空白列表里
####print(nl4)
#####方法三
####l5 = list(range(1,5))
####print (l5)
####for n3 in l5:             # n3是临时变量（自己定义）
####    l5[n3-1] = n3**2     #n3-1 是索引位置  n3 是获取range(1,5)中的数字 
#####修改命令 列表名[索引位置] = 修改的值,把该索引位置的数，变成这个数的平方
####print (l5)
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\#列表遍历，访问列表里的所有数据
####names = ["Lihua","Rain","Jack","Xiuxiu","Peiqi","Black","yi","er",]
####for n in names :   # n是临时变量（自己定义），n在names列表中一个一个的取数据，然后输出出来
####    print(n+"111")	#自动有缩进
####    print(n+"555")
####    
####print("全体")
#####for xxx(临时变量，自己定义变量名) in xxx（变量）：
#####        xxxxx(冒号后面的是循环体,就是要执行的代码)
####
####
#####\\\\\\\\\\\\\\\\\\\\\\\\\作业
####
#####创建列表
####names = ["Lihua","Rain","Jack","Xiuxiu","Peiqi","Black"]
####print(names)
#####black 前插入 blue
####names.insert(-1,"Blue")
####print(names)
#####输出4~7的元素
####e = names[4:7]
####print(e)
#####把xiuxiu的名字改成中文
####names[3] = "秀秀"
####print(names)
#####输出peiqi的索引值
####print(names.index("Peiqi")) 
#####创建列表nab，把其中元素插入列表names
####nab = [1,3,4,5,6,7,]
####names.extend(nab)
####print(names)
####
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\多维列表
####names = ["2yi","1er","San","si","wu"]    #这是一个列表，包含四个字符串 命名=[  ,  ,   ,  ,  ,]”   
####sco = [2,8,4,5,6,9,8]             #访问的元素必须存在
####a = ["is",12,1.2222,"xxxx"]       #列表中的元素是可以混用的，不影响输出
####print(names)
####print(sco)                        #sort方法是永久排序，对列表产生影响
####print(a)
####length = len(names)               #len方法取得列表长度，有几个元素
####print(length)     
####
####group = [["qq","ww","ee"],["aa","ss","dd"],["zz","xx","cc"]] #列表里包含三个元素，这三个元素都是列表，就是多（二）维列表
####print(group[0])                   #访问多维列表的第一个元素
####print(group[0][1])                #访问多维列表的第一个元素（列表），里的第二个元素
####print(group[0][0])
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\排序和翻转
####names = ["2yi","1er","San","si","wu"]    #这是一个列表，包含四个字符串 命名=[  ,  ,   ,  ,  ,]”   
####sco = [2,8,4,5,6,9,8]             #访问的元素必须存在
####print(names)
####print(sco)                        #sort方法是永久排序，对列表产生影响
#####names.sort()                      #按照首字母排序，大写排在小写的前面,第一个字母是数字的时候，排在前面，从1开始排
#####print(names)
#####sco.sort()                        #数字排序，默认从小到大
#####print(sco)
#####names.sort(reverse=True)          #从大到小排序，传递reverse=True的参数
#####sco.sort(reverse=True)
#####print(sco) 
#####print(names)
####
####newList = sorted(names)            #sorted方法不影响原来的列表排序
####print(names)
####print(newList)                 
####
####names.reverse()                    #reverse方法列表翻转，第一个和第五个调换位置，第二个和第四个调换位置，第三个和第三个调换位置
####print(names)
####sco.reverse()
####print(sco)
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ pop方法
####names = ["yi","er","san","si"]    #这是一个列表，包含四个字符串 命名=[  ,  ,   ,  ,  ,]”   
####sco = [2,3,4,5,6,7,8]             #访问的元素必须存在
####print(names)
####print(sco)
#####s = names.pop()                   #列表的pop方法， 默认先调用列表的最后一个元素，然后把这个元素删除（使用一次元素，然后把这个元素删除）
#####print(s)
####print(names.pop(0))                 #直接在print里，先调用第一个元素，显示，然后把它删除
####print(names)
####print(names.pop(-1))                #直接在print里，先调用最后一个元素，显示，然后把它删除
####print(names)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\访问列表元素和增、删、改元素
####names = ["yi","er","san","si"]    #这是一个列表，包含四个字符串 命名=[  ,  ,   ,  ,  ,]”   
####sco = [2,3,4,5,6,7,8]             #访问的元素必须存在
####print(names)
####print(sco)
####print(sco[0])
####print(names[1])             # 索引访问，输出names列表中的第一个字符串  列表中的排序方式是从0开始，0是yi，1是er，2是san。。。类推
####print(names[1].upper())     #字符串调用大写upper()方法，姓名变成了大写....
####print(names[-1])            #负数访问倒数第一个元素
####l2 = names[0:3]             #访问的数据是0-2个的元素，（不包括最后一个元素，也就是第3个元素），取头不取尾 
####print(l2)  
####l3 = names[0:4]             #访问了列表中的所有元素。不包括最后一个元素，访问了全部。
####print(l3)  
####l4 = names[1:3]              #访问了列表中第二和第三个元素
####print(l4)       
#####l5 = names[1:]               #默认结束到最后
#####l5 = names[:3]               #默认0开始44Q					
#####l5 = names[:]                #复制列表
#####print(l5)
####names[2] = "xiaoming"         #修改列表中的信息
####print(names)
####names.append("zhangsan")      #添加数据在列表，默认在最后一位
####print(names)
####names.insert(0,"xiaohua")     #在0号位置插入数据为“xiaohua”
####print(names)
#####del(names[0])                #第一种方法，删除列表第0个元素
#####del names[0]
#####del (names[-1])
####names.remove("xiaohua")       #第二种方法，调用列表方法，删除名叫“xiaohua”的元素（注意：元素必须存在）。
####print(names)                  #当存在两个一样的元素，默认只删除靠前的一个
####
####
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####print("请输入你的年龄")
####age = input()
####print("nide nianl shi")
####print(age)
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####res = input()              #用户输入   end 结束
####print("end" + res)
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
#####加法计算器
####print("加法计算器")
####print("输入第一个数字")
####a = input()                 #用户给a赋值（赋的值是）
####print("输入第二个数字")
####b = input()                  #用户给b赋值
####c = float(a) + float(b)     #c 把a和b的值（字符串）转化成float形式
####print("这两个和是：" )
####print(c)
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####message = "我的年龄" + str(18)   #str  把数字转化为字符串
####print(message)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####res = 30 + float("40")    #int（整数） 把（只有数字）字符串转化为数字  float（浮点数）
####res2 = 30 + int("40")
####print(res)
####print(res2)
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####mes = "hello" * 3        #"hello" 输出了三次  只能给整数
####print(mes)
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####python 2                   #python 2 和 3 除法保留整数的区别  
####6/4 = 1
####
####python 3
####6/4 =1.5
####6//4 = 1                  #//只保留正数部分（除法）
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####r1 = 1.1+1
####r2 = 2-1
####r3 = 2*3
####r4 = 2/3
####r5 = 2//3       #只保留正数部分（除法）
####r6 = 3%2       #求余数（除法） 
####r7 = 3**2       #求次方
####
####r8 = (2+3)*4     #()里优先级
####
####print(r1)
####print(r2)
####print(r3)
####print(r4)
####print(r5)
####print(r6)
####print(r7)
####print(r8)
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####m = "           eee     saaaaa    aaa   "
####m1 = m.lstrip()            #去除头部空白
####print(m1)
####m2 = m.rstrip()            #去除尾部空白
####print(m2)
####m3 = m.strip()             #头和尾一起去除
####print(m3)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####print("a b")           #空格键
####print("a	b")     #tab键 
####print("a\tb")         #  \t空格
####print("a\nb")          # \n换行
####print(len("a	b"))    #输出字符串长度
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####name = "hello " + "xoxo" + "!"  #字符串拼接
####print("hi" + "qqqq" + name)
####print(name)
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\
####m = "my name is XXX"
####m2 = m.title()                       #调用m里的title方法  首字母大写,其他小写
####m3 = m.upper()                       #调用m里的方法  全部大写
####m4 = m.lower()                      #调用m里的方法  全部小写
####print(m)
####print(m2)
####print(m3)
####print(m4)
####length = len(m)               #通过len的方法取得 m的字符长度 ，赋值给length（包括空格）
####print(length)
####
####length = len("quit")             #可以直接给字符串，也能取得长度
####print(length)   
####
####
####
####
####
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####m = "hello"
####m2 = 'hello l'
####m3 = 'hello "lll"ooo' 
####m4 = "www'qqq rrrr"
####m5 = 'i \'m xixi "ooo'  #单引号 之前加"\" 转意字符
####m6 = "i 'm xixi \"ooo " #双引号 之前加"\"
####print(m)
####print(m2)
####print(m3)
####print(m4)
####print(m5)
####print(m6)
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####msg = "hello world"
####print(msg)
####print(msg)
####print(msg)
####print(msg)
####print(msg)
####\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
####hp = 100
####print(hp)
####hp = 90
####print(hp)
####
####"""
####
####"""
####print ( a.decode('utf-8').encode('gbk' ))
####"""



